[
  "The espresso machine unionized again and refuses to froth without a formal escalation.",
  "Facilities installed a new open office concept, which is just the parking lot with Wi-Fi.",
  "IT insists my laptop needs a firmware update that only runs during full moons.",
  "Someone booked the only quiet room for a 6-hour meeting about booking quiet rooms.",
  "The corporate VPN now requires a drop of dragon blood and a faxed OTP.",
  "HR launched a mindfulness gong that rings every 45 seconds near my desk.",
  "The badge readers are being recalibrated to detect insufficient synergy.",
  "Security confiscated my keyboard because it wasn't aligned with the brand guidelines.",
  "The office coffee is now just a suggestion written on a whiteboard.",
  "My ergonomic chair was reassigned to a visiting consultant's emotional support cactus.",
  "The air conditioning is stuck on 'arctic tundra' pending a root-cause retro.",
  "Desktop Support can only fix my monitor if I bring it to the 17th floor at sunrise.",
  "Legal needs me remote to avoid conflicting with their mandatory hallway trust fall.",
  "The elevator is in use for a live-fire corporate jargon training exercise.",
  "My desk became the pilot site for experimental standing beanbag chairs.",
  "Finance scheduled a budget review on my floor and the spreadsheets emit fumes.",
  "All meeting rooms are booked for a workshop on how to book meeting rooms.",
  "The office cat union filed a grievance about me typing too loudly.",
  "Facilities replaced the windows with inspirational posters about resilience.",
  "My access card now requires three-factor authentication and a manager's interpretive dance.",
  "The new wellness initiative mandates I meditate with corporate consultants in the broom cupboard.",
  "Management implemented hot-desking, but forgot to provide desks.",
  "The printer queue has achieved sentience and is holding my documents hostage.",
  "Security updated our badges to only work during Mercury retrograde.",
  "The 'agile transformation' consultant locked himself in the supply closet with the Post-it notes.",
  "HR scheduled mandatory fun that clashes with my existential dread.",
  "The office thermostat is now controlled by a committee that meets quarterly.",
  "Someone replaced all the chairs with exercise balls that deflated overnight.",
  "Legal classified my desk as a health hazard due to excessive productivity.",
  "The new break room microwave only heats food that's been pre-approved by facilities.",
  "IT declared my browser 'too old' despite it being updated this morning.",
  "The office plants have been relocated to form a feng shui barrier around my workspace.",
  "Management installed motion sensors that require interpretive dance to activate.",
  "The water cooler was replaced with a motivational speaker who won't stop talking.",
  "Someone scheduled a fire drill during the quarterly all-hands about fire safety.",
  "Facilities painted racing stripes on the floor but forgot to mention the wet paint.",
  "The conference room windows were tinted with one-way glass facing inward.",
  "HR's new open door policy involved removing all the doors entirely.",
  "The lift buttons have been rearranged alphabetically for 'user experience optimization'.",
  "Someone installed a revolving door in the tea kitchen that only turns clockwise.",
  "The office speakers now play whale sounds during 'focused work hours'.",
  "Management replaced all pens with crayons to encourage creative thinking.",
  "The parking spaces have been redesigned by someone who's never seen a car.",
  "IT migrated our files to 'the cloud' but won't say which one.",
  "The office dog walker got confused and now there are seventeen golden retrievers in reception.",
  "Facilities installed automatic air fresheners that smell suspiciously like despair.",
  "The new collaboration space is just four beanbags arranged around a traffic cone.",
  "HR's team-building exercise involves constructing furniture from badly translated Swedish instructions.",
  "The printer now requires a blood sacrifice and a small offering of biscuits.",
  "Someone moved my desk to the corridor to 'improve cross-departmental synergy'.",
  "The coffee machine has been programmed to only work during approved break times.",
  "Management hired a mime artist to improve our non-verbal communication skills.",
  "The office WiFi is now password-protected with riddles that change hourly.",
  "Facilities replaced the ceiling tiles with mirrors to 'increase natural light reflection'.",
  "The new environmental policy means the heating only works on days ending in 'y'.",
  "Someone installed a slide from the second floor, but it ends in a filing cabinet.",
  "The office ghost has filed a noise complaint about my keyboard clicking.",
  "HR's mindfulness corner is just a cardboard box with 'ZEN' written in Comic Sans.",
  "The emergency exit signs now point to a motivational poster about perseverance.",
  "IT updated our security protocols to include a daily interpretive dance authentication.",
  "The office cat has been promoted to Senior Vice President of Morale.",
  "Facilities installed a moat around the executive washroom for 'enhanced privacy'.",
  "The new hot-desking system requires solving a crossword puzzle to unlock each workstation.",
  "Someone replaced all the fluorescent bulbs with disco balls for 'ambiance enhancement'.",
  "The office bicycle parking has been converted into a zen garden, bicycles not included.",
  "Management's new 'paperless office' initiative involves burning documents in the car park.",
  "The lift music has been replaced with recordings of previous staff meetings.",
  "HR scheduled a mandatory workshop on 'Leveraging Synergistic Paradigm Optimization'.",
  "The office aquarium has been relocated to the server room for 'thermal management'.",
  "Someone installed a revolving bookshelf that only stops on pages about workplace compliance.",
  "Facilities painted the walls with glow-in-the-dark paint that only glows at night.",
  "The office hamster wheel has been repurposed as the new desk chair adjustment mechanism.",
  "IT's latest security update requires singing the company anthem to log in.",
  "The water fountain now dispenses motivational quotes instead of water.",
  "Someone installed speed bumps in the hallway to 'encourage mindful walking'.",
  "HR's new conflict resolution process involves sock puppet mediation.",
  "The stationary cupboard has been converted into a meditation pod that locks from outside.",
  "Management hired a professional yodeler to announce important meetings.",
  "The office toaster now requires a user manual and three forms of identification.",
  "Someone replaced the hand dryers with tiny wind machines that blow in random directions.",
  "The new ergonomic assessment involves balancing on a yoga ball while typing.",
  "Facilities installed automatic doors that only open for people wearing ties.",
  "The office suggestion box has been welded shut pending a risk assessment.",
  "HR's diversity training involves mandatory participation in amateur dramatics.",
  "Someone installed traffic lights in the corridor, but nobody knows what they mean.",
  "The office plants have been given name badges and scheduled for performance reviews.",
  "IT's cloud migration has resulted in actual clouds forming above certain workstations.",
  "The new brainstorming room is just a cupboard with 'THINK' painted on all six walls.",
  "Facilities replaced the reception desk with a bouncy castle for 'approachability'.",
  "The office printer now communicates exclusively through interpretive beeping patterns.",
  "HR's new recruitment strategy involves divination and tea leaf reading.",
  "The office fish have unionized and are demanding better working conditions.",
  "Management's cost-cutting initiative replaced all lightbulbs with glow sticks.",
  "The new workspace design consultant appears to be a confused geography teacher.",
  "Someone installed a red telephone box in the lobby, but it's actually a printer queue.",
  "The office vending machine now only accepts payment in company loyalty points.",
  "The new health and safety officer is actually just a traffic cone with a clipboard.",
  "HR scheduled a team-building exercise that involves constructing a scale model of productivity.",
  "The office basement has been converted into a complaints department staffed entirely by interns.",
  "Someone replaced the motivational posters with actual mirrors that reflect our life choices."
]
